app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Buildings"]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 1]]
---
	def index
		if params[:category].blank?
			@articles = Article.all.order("created_at DESC")
		else
				@category_id = Category.find_by(name: params[:category]).id
				@articles = Article.where(category_id: @category_id).order("created_at DESC")

INSERT INTO "articles" ("title", "content", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Q Style"], ["content", "This is Q style building"], ["category_id", 1], ["user_id", 1], ["created_at", "2016-03-10 03:01:45.921292"], ["updated_at", "2016-03-10 03:01:45.921292"]]
---
	def create
		@article = current_user.articles.build(article_params)
		if@article.save